---
kind: type
id: T:Autodesk.Revit.DB.MultiSegmentGrid
source: html/8488ef7c-7669-26a7-8088-dd78e96850de.htm
---
# Autodesk.Revit.DB.MultiSegmentGrid

This element acts as a multi-segmented Grid. The individual grids associated to
 the MultiSegmentGrid behave as a single unit and all share the same text. They inherit
 their type (GridType) from the MultiSegmentGrid.

## Syntax (C#)
```csharp
public class MultiSegmentGrid : Element
```